# -*- coding: utf-8 -*-
# @Time    : 2022/10/3 10:23
# @Author  : LiZhen
# @FileName: constants.py
# @github  : https://github.com/Lizhen0628
# @Description:


emoji_face = {"\ue415": ["笑脸", "\U0001f604"], "\ue40c": ["生病", "\U0001f637"], "\ue412": ["笑哭", "\U0001f602"],
              "\ue409": ["吐舌头", "\U0001f61d"], "\ue40d": ["耿直", "\U0001f633"], "\ue107": ["恐惧", "\U0001f631"],
              "\ue403": ["失望", "\U0001f614"], "\ue40e": ["无语", "\U0001f612"], "\ue11b": ["吐舌头", "\U0001f47b"],
              "\ue41d": ["祈祷", "\U0001f64f"], "\ue14c": ["加油", "\U0001f4aa"], "\ue312": ["庆祝", "\U0001f389"],
              "\ue112": ["礼物", "\U0001f381"]}


